# St7SetModalSuperpositionFile

Assigns the modal superposition file to be used for harmonic response, spectral response and linear transient
dynamic analysis with mode superposition.

long St7SetModalSuperpositionFile(long uID, char* FileName)
Input Parameters
uID
Strand7 model file ID.
FileName
Full path and name for the modal superposition file.